backend/app/controllers/destinations_controller.rb

SELECT "destinations".* FROM "destinations"
---
    def index
        destinations =Destination.all

INSERT INTO "destinations" ("city", "country", "importance", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["city", "Bora Bora"], ["country", "Island"], ["importance", 5], ["user_id", 5], ["created_at", "2021-02-21 21:25:47.859808"], ["updated_at", "2021-02-21 21:25:47.859808"]]
---
    def create
        destination = Destination.create(destination_params)

SELECT "destinations".* FROM "destinations" WHERE "destinations"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
DELETE FROM "destinations" WHERE "destinations"."id" = ?  [["id", 4]]
---
    def destroy
        destination = Destination.find(params[:id])
        destination.destroy