backend/app/controllers/users_controller.rb

    def create

        user = User.find_by(name: params[:name])
        if user
            render json: user, include: [:destinations]
            # binding.pry
        else
            newUser = User.create(name: params[:name])
---
SELECT "users".* FROM "users" WHERE "users"."name" = ? LIMIT ?  [["name", ""], ["LIMIT", 1]]
INSERT INTO "users" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Kirsten"], ["created_at", "2021-02-20 19:52:26.784962"], ["updated_at", "2021-02-20 19:52:26.784962"]]